Repository: KonarAndriiana/Bugless
Catalog: EDU/EDU/Other/Localizable.xcstrings
Source language: en
Languages: sk

source: Welcome to Courses. Please choose a course to see lectures
sk: Vitajte v kurzoch. Vyberte kurz, aby ste si pozreli prednášky.

source: Basic Java Syntax
sk: Základná syntax Javy

source: Before we start
sk: Predtým, než začneme

source: Choose the language you want to use
sk: Vyberte jazyk, ktorý chcete použiť

source: Content
sk: Obsah

source: Courses
sk: Kurz

# cssActionText
source: Unlock the power of design and make the web beautiful with cascading styles. - Selectors - Flexbox - Grid - Animations - Responsive Design CSS stands for "Cascading Style Sheets," but some devs joke it means "Can’t Style Stuff" when debugging weird layout bugs. 😬
sk: Odomknite silu dizajnu a spravte web krásnym pomocou kaskádových štýlov. -Selektory -Flexbox -Grid -Animácie -Reaktívny dizajn CSS znamená "Cascading Style Sheets," ale niektorí vývojári si robia žarty, že to znamená "Can’t Style Stuff" (Nedokážem nastylovať veci) pri ladení divných problémov s rozložením. 😬

source: Dark Theme
sk: Tmavý režim

source: English
sk: Angličtina

source: Favorite Courses
sk: Obľúbené kurzy

source: Find Your
sk: Nájdite svoje

source: Get Started
sk: Začať

source: Getting Started with Java
sk: Začiatky s Javou

# htmlActionText
source: Learn to structure the web with the language that started it all. - Semantic HTML - Forms - Multimedia Elements - Accessibility The <blink> tag was so annoying it was banished from HTML. RIP <blink>; you won’t be missed. 👀
sk: Naučte sa štruktúrovať web pomocou jazyka, ktorý to všetko začal. -Sémantický HTML -Formuláre -Multimediálne prvky -Prístupnosť Tag <blink> bol tak otravný, že bol z HTML vyhnaný. RIP <blink>; nebudeš nám chýbať. 👀

source: Incorrect password. Please try again.
sk: Nesprávne heslo. Skúste to prosím znovu.

source: Invalid email format. Please check your email.
sk: Neplatný formát emailu. Skontrolujte prosím svoj email.

source: Java is a versatile programming language known for its scalability and robust performance. In this session, we'll explore Java's foundational syntax, focusing on variable declaration and manipulation. Java Syntax: Java employs a structured syntax where every statement ends with a semicolon (`;`). A Java application typically starts with a class definition and includes a `main` method as the entry point for execution. Variables in Java: Variables store data in a program and are defined by specific data types. Here are some commonly used types: - `int`: For whole numbers - `float`: For fractional numbers with less precision - `String`: To store text - `char`: To store a single character In the next section, we'll see how to declare and initialize variables in Java.
sk: Java je univerzálny programovací jazyk, známy svojou škálovateľnosťou a robustným výkonom. V tejto sekcii preskúmame základnú syntax Javy, so zameraním na deklaráciu a manipuláciu s premennými. Syntax Javy: Java používa štruktúrovanú syntax, kde každý príkaz končí bodkočiarkou (;). Java aplikácia zvyčajne začína definíciou triedy a obsahuje metódu main, ktorá slúži ako vstupný bod pre vykonanie programu. Premenné v Jave: Premenné ukladajú údaje v programe a sú definované špecifickými dátovými typmi. Tu sú niektoré bežne používané typy: -int: Pre celé čísla -float: Pre zlomkové čísla s menšou presnosťou -String: Pre ukladanie textu -char: Pre ukladanie jedného znaku V nasledujúcej sekcii uvidíme, ako deklarovať a inicializovať premenné v Jave.

# javaActionText
source: Explore the foundation of object-oriented programming and build robust applications that can run anywhere, anytime. - Core Java - OOP Principles - Collections Framework - Streams - Multithreading "Write Once, Debug Everywhere" is the unofficial motto of Java developers dealing with cross-platform quirks. 😅
sk: Preskúmajte základy objektovo orientovaného programovania a vytvorte robustné aplikácie, ktoré môžu bežať kdekoľvek a kedykoľvek. -Základný Java -Princípy OOP -Rámec kolekcií -Streamy -Multithreading „Napísať raz, debugovať všade“ je neoficiálne motto Java vývojárov, ktorí sa stretávajú s nejasnosťami medzi platformami. 😅

source: Language
sk: Jazyk

source: Light Theme
sk: Svetlý režim

source: Log Out
sk: Odhlásiť sa

source: Network error. Please check your connection.
sk: Chyba siete. Skontrolujte svoje pripojenie.

source: Password
sk: Heslo

source: Please check your input information and try again.
sk: Skontrolujte prosím svoje zadané informácie a skúste to znovu.

# pythonActionText
source: Dive into one of the most versatile programming languages and bring your ideas to life. - Data Types - Control Structures - Libraries - APIs Python's print("Hello, World!") is the first thing you’ll learn when starting with Python. 👋
sk: Ponorte sa do jedného z najviac univerzálnych programovacích jazykov a oživte svoje nápady. -Dátové typy -Riadiace štruktúry -Knižnice -APIs Pythonova print("Hello, World!") je prvá vec, ktorú sa naučíte pri začiatkoch s Pythonom. 👋

source: Slovak
sk: Slovenčina

# sqlActionText
source: Dive into the heart of data management and unlock the secrets of relational databases with SQL! 💾✨ - Data Queries (SELECT) - Filtering Data (WHERE) - Combining Tables (JOINs) - Aggregate Magic (COUNT, SUM, AVG) - Transactions (BEGIN, COMMIT, ROLLBACK) SQL stands for "Structured Query Language," but when debugging tricky queries, some devs joke it means "Slightly Questionable Logic" instead. 😅
sk: Ponorte sa do srdca správy dát a odomknite tajomstvá relačných databáz pomocou SQL! 💾✨ -Dotazy na dáta (SELECT) -Filtrovanie dát (WHERE) -Kombinácia tabuliek (JOINs) -Agregačné kúzla (COUNT, SUM, AVG) -Transakcie (BEGIN, COMMIT, ROLLBACK) SQL znamená „Structured Query Language“ (Štruktúrovaný dotazovací jazyk), ale pri ladení zložitých dotazov niektorí vývojári žartujú, že to znamená „Slightly Questionable Logic“ (Trochu sporná logika). 😅

source: The email is already in use by another account.
sk: Tento email je už používaný iným účtom.

source: This account has been disabled. Please contact support.
sk: Tento účet bol deaktivovaný. Kontaktujte prosím podporu.

source: Too many login attempts. Please try again later.
sk: Príliš veľa pokusov o prihlásenie. Skúste to prosím neskôr.

source: Topics Covered
sk: Prebrané témy

source: User not found. Please check your email.
sk: Užívateľ nebol nájdený. Skontrolujte prosím svoj email.

# welcomeText
source: Welcome to Courses. Please choose a course to see lectures
sk: Vitajte v kurzoch. Vyberte kurz, aby ste si pozreli prednášky.

source: Working with Variables
sk: Práca s premennými

source: You need to write in fields belows your school email and password from your school Edupage
sk: Musíte zadať do polí nižšie svoj školský email a heslo z Edupage vašej školy.
